import os

# Получаем путь к корневой папке проекта
PROJECT_ROOT = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
PATH_TO_MODEL = os.path.join(PROJECT_ROOT, "models", "vosk-model-small-ru-0.22")

# Настройки времени ожидания до начала службы
SERVICE_WAIT_ENABLED = True  # Включить/выключить ожидание

# Настройки служб: {день_недели: (час, минута, название_службы)}
# День недели: 0 = понедельник, 1 = вторник, ..., 6 = воскресенье
SERVICE_SCHEDULE = {
    0: (7, 55, "будничная"),  # Понедельник
    1: (7, 55, "будничная"),  # Вторник
    2: (7, 55, "будничная"),  # Среда
    3: (7, 55, "будничная"),  # Четверг
    4: (7, 55, "будничная"),  # Пятница
    5: (7, 55, "будничная"),  # Суббота
    6: (8, 25, "воскресная")  # Воскресенье
}
